In [1]:
import pandas as pd

In [2]:
muestra = pd.read_csv(r'C:\Users\pablo\Kaggle_Competition\data\muestra.csv',encoding='latin1')
salary_data = pd.read_csv(r'C:\Users\pablo\Kaggle_Competition\data\salaries_data.csv',encoding='latin1')
testeo = pd.read_csv(r'C:\Users\pablo\Kaggle_Competition\data\testeo.csv',encoding='latin1')

In [3]:
muestra

      id  salary_in_usd
0      0          70377
1      1          85839
2      2          63613
3      3          88561
4      4          37621
..   ...            ...
102  102          70639
103  103          33678
104  104          19021
105  105          21175
106  106          34801

[107 rows x 2 columns]

In [4]:
X  = salary_data.drop('salary_in_usd',axis = 1)
X_testeo = testeo.copy()

In [5]:
concat = pd.concat([X, X_testeo], axis = 0)

In [6]:
concat.shape

(607, 10)

In [7]:
concat.head(5)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,employee_residence,remote_ratio,company_location,company_size
0,2022,SE,FT,Data Engineer,140250,USD,US,100,US,M
1,2022,SE,FT,Data Engineer,135000,USD,US,100,US,M
2,2021,MI,FT,BI Data Analyst,100000,USD,US,100,US,M
3,2021,MI,CT,ML Engineer,270000,USD,US,100,US,L
4,2021,MI,FT,Data Engineer,22000,EUR,RO,0,US,L

In [8]:
concat.experience_level.unique()

array(['SE', 'MI', 'EN', 'EX'], dtype=object)

In [9]:
# label encoder

from sklearn.preprocessing import LabelEncoder, OrdinalEncoder

concat.experience_level=LabelEncoder().fit_transform(concat.experience_level)

concat.tail(5)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,employee_residence,remote_ratio,company_location,company_size
102,2022,3,FT,Data Analyst,170000,USD,US,100,US,M
103,2022,3,FT,Data Architect,192564,USD,US,100,US,M
104,2022,3,FT,Data Scientist,230000,USD,US,100,US,M
105,2022,0,FT,Data Analyst,52000,USD,CA,0,CA,M
106,2022,3,FT,Data Analyst,129000,USD,US,0,US,M

In [10]:
salary_data.employment_type.unique()

array(['FT', 'CT', 'FL', 'PT'], dtype=object)

In [11]:
# label encoder

from sklearn.preprocessing import LabelEncoder, OrdinalEncoder

concat.employment_type=LabelEncoder().fit_transform(concat.employment_type)

concat.head(5)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,employee_residence,remote_ratio,company_location,company_size
0,2022,3,2,Data Engineer,140250,USD,US,100,US,M
1,2022,3,2,Data Engineer,135000,USD,US,100,US,M
2,2021,2,2,BI Data Analyst,100000,USD,US,100,US,M
3,2021,2,0,ML Engineer,270000,USD,US,100,US,L
4,2021,2,2,Data Engineer,22000,EUR,RO,0,US,L

In [12]:
# label encoder

from sklearn.preprocessing import LabelEncoder, OrdinalEncoder

concat.company_size=LabelEncoder().fit_transform(concat.employment_type)

concat.head(5)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,employee_residence,remote_ratio,company_location,company_size
0,2022,3,2,Data Engineer,140250,USD,US,100,US,2
1,2022,3,2,Data Engineer,135000,USD,US,100,US,2
2,2021,2,2,BI Data Analyst,100000,USD,US,100,US,2
3,2021,2,0,ML Engineer,270000,USD,US,100,US,0
4,2021,2,2,Data Engineer,22000,EUR,RO,0,US,2

In [13]:
# label encoder

from sklearn.preprocessing import LabelEncoder, OrdinalEncoder

concat.remote_ratio=LabelEncoder().fit_transform(concat.employment_type)

concat.head(5)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,employee_residence,remote_ratio,company_location,company_size
0,2022,3,2,Data Engineer,140250,USD,US,2,US,2
1,2022,3,2,Data Engineer,135000,USD,US,2,US,2
2,2021,2,2,BI Data Analyst,100000,USD,US,2,US,2
3,2021,2,0,ML Engineer,270000,USD,US,0,US,0
4,2021,2,2,Data Engineer,22000,EUR,RO,2,US,2

In [14]:
concat.remote_ratio.value_counts()

2    588
3     10
0      5
1      4
Name: remote_ratio, dtype: int64

In [15]:
# label encoder

from sklearn.preprocessing import LabelEncoder, OrdinalEncoder

concat.remote_ratio=LabelEncoder().fit_transform(concat.employment_type)

concat.head(5)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,employee_residence,remote_ratio,company_location,company_size
0,2022,3,2,Data Engineer,140250,USD,US,2,US,2
1,2022,3,2,Data Engineer,135000,USD,US,2,US,2
2,2021,2,2,BI Data Analyst,100000,USD,US,2,US,2
3,2021,2,0,ML Engineer,270000,USD,US,0,US,0
4,2021,2,2,Data Engineer,22000,EUR,RO,2,US,2

In [16]:
from sklearn.preprocessing import LabelEncoder, OrdinalEncoder

In [17]:
cols_label = ['job_title','salary_currency', 'employee_residence','company_location']

for i in cols_label:
    concat[i]=LabelEncoder().fit_transform(concat[i])
    
concat.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,employee_residence,remote_ratio,company_location,company_size
0,2022,3,2,17,140250,16,55,2,48,2
1,2022,3,2,17,135000,16,55,2,48,2
2,2021,2,2,5,100000,16,55,2,48,2
3,2021,2,0,36,270000,16,55,0,48,0
4,2021,2,2,17,22000,7,47,2,48,2

In [18]:
concat.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 607 entries, 0 to 106
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           607 non-null    int64
 1   experience_level    607 non-null    int32
 2   employment_type     607 non-null    int32
 3   job_title           607 non-null    int32
 4   salary              607 non-null    int64
 5   salary_currency     607 non-null    int32
 6   employee_residence  607 non-null    int32
 7   remote_ratio        607 non-null    int64
 8   company_location    607 non-null    int32
 9   company_size        607 non-null    int64
dtypes: int32(6), int64(4)
memory usage: 37.9 KB

In [19]:
%pip install lazypredict

Requirement already satisfied: lazypredict in c:\users\pablo\anaconda3\lib\site-packages (0.2.12)
Requirement already satisfied: click in c:\users\pablo\anaconda3\lib\site-packages (from lazypredict) (8.0.4)
Requirement already satisfied: scikit-learn in c:\users\pablo\anaconda3\lib\site-packages (from lazypredict) (1.0.2)
Requirement already satisfied: pandas in c:\users\pablo\anaconda3\lib\site-packages (from lazypredict) (1.4.2)
Requirement already satisfied: xgboost in c:\users\pablo\anaconda3\lib\site-packages (from lazypredict) (1.7.1)
Requirement already satisfied: lightgbm in c:\users\pablo\anaconda3\lib\site-packages (from lazypredict) (3.3.3)
Requirement already satisfied: joblib in c:\users\pablo\anaconda3\lib\site-packages (from lazypredict) (1.1.0)
Requirement already satisfied: tqdm in c:\users\pablo\anaconda3\lib\site-packages (from lazypredict) (4.64.0)
Requirement already satisfied: colorama in c:\users\pablo\anaconda3\lib\site-packages (from click->lazypredict) (0.4.4)
Requirement already satisfied: wheel in c:\users\pablo\anaconda3\lib\site-packages (from lightgbm->lazypredict) (0.37.1)
Requirement already satisfied: numpy in c:\users\pablo\anaconda3\lib\site-packages (from lightgbm->lazypredict) (1.21.5)
Requirement already satisfied: scipy in c:\users\pablo\anaconda3\lib\site-packages (from lightgbm->lazypredict) (1.7.3)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\pablo\anaconda3\lib\site-packages (from scikit-learn->lazypredict) (2.2.0)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\pablo\anaconda3\lib\site-packages (from pandas->lazypredict) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\pablo\anaconda3\lib\site-packages (from pandas->lazypredict) (2021.3)
Requirement already satisfied: six>=1.5 in c:\users\pablo\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas->lazypredict) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [20]:
from lazypredict.Supervised import LazyRegressor

from sklearn import datasets

from sklearn.utils import shuffle

import numpy as np

In [21]:
X_testeo = concat[-107:] # previamente hemos dropeado la columna objetivo salary_in_usd, antes de concat TESTEO
X = concat[:-107] # viene del archivo testeo donde no existe la columna salary_in_usd, antes de concat TRAIN

In [22]:
len(X)

500

In [23]:
len(X_testeo)

107

### 1ยบ DETERMINAMOS X y Y

In [24]:
y = salary_data.salary_in_usd

In [25]:
X # salary_data

,work_year,experience_level,employment_type,job_title,salary,salary_currency,employee_residence,remote_ratio,company_location,company_size
0,2022,3,2,17,140250,16,55,2,48,2
1,2022,3,2,17,135000,16,55,2,48,2
2,2021,2,2,5,100000,16,55,2,48,2
3,2021,2,0,36,270000,16,55,0,48,0
4,2021,2,2,17,22000,7,47,2,48,2
...,...,...,...,...,...,...,...,...,...,...
495,2022,3,2,17,100000,16,55,2,48,2
496,2021,0,2,7,435000,10,27,2,7,2
497,2022,3,2,16,90700,16,8,2,6,2
498,2021,2,2,17,60000,8,20,2,18,2
499,2021,0,2,11,70000,16,55,2,48,2

### 2ยบ SPLITEAMOS X y Y TRAIN, TEST

In [26]:
from sklearn.model_selection import train_test_split as tts

In [27]:
X_train, X_test, y_train, y_test = tts(X, y, train_size=0.8, test_size=0.2, random_state=22)

X_train.shape, X_test.shape, y_train.shape, y_test.shape

((400, 10), (100, 10), (400,), (100,))

### 3ยบ INICIAMOS MODELO

In [28]:
reg = LazyRegressor(verbose=0, ignore_warnings=False, custom_metric=None)

### 4ยบ ENTRENAMOS

In [29]:
models, predictions = reg.fit(X_train, X_test, y_train, y_test)
print(models)

100%|โโโโโโโโโโ| 42/42 [00:09<00:00,  4.60it/s]

                               Adjusted R-Squared  R-Squared      RMSE  \
Model
GradientBoostingRegressor                    0.95       0.96  11610.13
RandomForestRegressor                        0.95       0.95  12046.43
BaggingRegressor                             0.95       0.95  12217.32
XGBRegressor                                 0.94       0.95  12581.35
HistGradientBoostingRegressor                0.94       0.95  12602.94
LGBMRegressor                                0.94       0.95  12947.56
DecisionTreeRegressor                        0.93       0.94  14306.18
ExtraTreesRegressor                          0.93       0.94  14364.63
AdaBoostRegressor                            0.91       0.92  15729.52
ExtraTreeRegressor                           0.76       0.79  26013.52
KNeighborsRegressor                          0.55       0.60  35777.36
PoissonRegressor                             0.33       0.40  43642.90
PassiveAggressiveRegressor                   0.33       0.40  43832.46
GaussianProcessRegressor                     0.33       0.39  43923.47
GammaRegressor                               0.30       0.37  44660.36
HuberRegressor                               0.30       0.37  44810.46
BayesianRidge                                0.29       0.36  45010.09
RidgeCV                                      0.29       0.36  45069.12
SGDRegressor                                 0.29       0.36  45156.62
Ridge                                        0.29       0.36  45175.57
Lasso                                        0.29       0.36  45194.12
TransformedTargetRegressor                   0.29       0.36  45194.54
LinearRegression                             0.29       0.36  45194.54
Lars                                         0.28       0.36  45263.98
LassoLars                                    0.28       0.36  45265.96
LassoLarsIC                                  0.28       0.36  45289.02
LassoCV                                      0.28       0.36  45312.90
LassoLarsCV                                  0.28       0.35  45358.85
LarsCV                                       0.28       0.35  45358.85
ElasticNet                                   0.28       0.35  45459.75
TweedieRegressor                             0.25       0.33  46178.92
OrthogonalMatchingPursuitCV                  0.25       0.32  46380.54
OrthogonalMatchingPursuit                    0.07       0.17  51502.60
ElasticNetCV                                -0.07       0.04  55422.00
SVR                                         -0.11       0.00  56409.11
NuSVR                                       -0.11      -0.00  56429.92
QuantileRegressor                           -0.11      -0.00  56432.66
DummyRegressor                              -0.14      -0.03  57158.06
KernelRidge                                 -3.52      -3.06 113739.25
LinearSVR                                   -3.99      -3.48 119456.81
MLPRegressor                                -4.01      -3.50 119732.05
RANSACRegressor                            -13.73     -12.24 205342.73

                               Time Taken
Model
GradientBoostingRegressor            0.07
RandomForestRegressor                0.24
BaggingRegressor                     0.07
XGBRegressor                         0.60
HistGradientBoostingRegressor        0.67
LGBMRegressor                        0.16
DecisionTreeRegressor                0.01
ExtraTreesRegressor                  0.15
AdaBoostRegressor                    0.49
ExtraTreeRegressor                   0.01
KNeighborsRegressor                  0.11
PoissonRegressor                     0.06
PassiveAggressiveRegressor           0.11
GaussianProcessRegressor             0.36
GammaRegressor                       0.18
HuberRegressor                       0.03
BayesianRidge                        2.09
RidgeCV                              0.02
SGDRegressor                         0.01
Ridge                                0.01
Lasso                                0.02
TransformedTargetRegressor           0.01
LinearRegression                     0.01
Lars                                 0.05
LassoLars                            0.01
LassoLarsIC                          0.17
LassoCV                              0.09
LassoLarsCV                          0.02
LarsCV                               0.07
ElasticNet                           0.07
TweedieRegressor                     0.01
OrthogonalMatchingPursuitCV          0.03
OrthogonalMatchingPursuit            0.01
ElasticNetCV                         0.45
SVR                                  0.03
NuSVR                                0.06
QuantileRegressor                    1.45
DummyRegressor                       0.01
KernelRidge                          0.17
LinearSVR                            0.05
MLPRegressor                         0.42
RANSACRegressor                      0.39

### MODELO : RANDOM FOREST REGRETION

In [30]:
from sklearn.ensemble import RandomForestRegressor as Rfr

In [31]:
X_train

,work_year,experience_level,employment_type,job_title,salary,salary_currency,employee_residence,remote_ratio,company_location,company_size
94,2022,3,2,17,181940,16,55,2,48,2
350,2020,0,2,12,10000,16,39,2,36,2
288,2021,1,0,46,416000,16,55,0,48,0
420,2021,1,2,25,110000,7,14,2,12,2
163,2020,0,2,19,423000,10,27,2,25,2
...,...,...,...,...,...,...,...,...,...,...
356,2021,2,2,48,53000,7,19,2,17,2
448,2020,2,2,17,88000,8,20,2,18,2
300,2022,3,2,17,60000,8,20,2,18,2
132,2021,2,2,22,147000,16,55,2,48,2
373,2021,0,2,8,50000,7,34,2,31,2

In [32]:
X_train, X_test, y_train, y_test = tts(X, y, train_size=0.8, test_size=0.2, random_state=22)

X_train.shape, X_test.shape, y_train.shape, y_test.shape

((400, 10), (100, 10), (400,), (100,))

### Entrenamos

In [33]:
rfr = Rfr()  # iniciamos modelo

In [34]:
rfr.fit(X_train, y_train) # 2ยบ ENTRENAR los valores train >>>> modelo.fit(x_train, y_train) ++++ X TRAIN +++++

RandomForestRegressor()

In [35]:
y_pred_train=rfr.predict(X_train) # 3ยบ CALCULAR Y PREDECIR  >>>'y_predecida' = modelo.predict(x_train)  ++++ X_Train ++++

In [36]:
y_pred_train[:10]

array([182144.4 ,  10398.87, 407300.  , 120673.07,  15450.54, 130117.5 ,
       119970.  , 150063.4 ,   5881.5 , 180000.  ])

In [37]:
len(y_pred_train)

400

In [38]:
y_pred_train = list(y_pred_train)
y_pred_train[:10]

[182144.4,
 10398.87,
 407300.0,
 120673.07,
 15450.54,
 130117.5,
 119970.0,
 150063.4,
 5881.5,
 180000.0]

In [39]:
len(X_train)

400

### Testeamos

In [40]:
rfr.fit(X_train, y_train)

RandomForestRegressor()

In [41]:
y_pred_testeo=rfr.predict(X_testeo) # +++++ UTILIZAMOS LA MUESTRA DE TESTEO KAGGLE+++++++

In [42]:
y_pred_testeo[:10]

array([172943.5 ,  87680.  ,  84892.22, 144349.28,  28957.12,  20198.68,
        70789.19,  51775.83,  47824.59, 188846.4 ])

In [43]:
y_pred_testeo = list(y_pred_testeo)
y_pred_testeo[:10]

[172943.5,
 87680.0,
 84892.22,
 144349.28,
 28957.12,
 20198.68,
 70789.19,
 51775.83,
 47824.59,
 188846.4]

In [44]:
len(y_pred_testeo)

107

### Comparamos el valor original en una data frame el valor original, la prediccion dle train y la del test

In [45]:
y

0      140250
1      135000
2      100000
3      270000
4       26005
        ...
495    100000
496      5882
497     90700
498     82528
499     70000
Name: salary_in_usd, Length: 500, dtype: int64

In [46]:
y_pred_testeo[:10]

[172943.5,
 87680.0,
 84892.22,
 144349.28,
 28957.12,
 20198.68,
 70789.19,
 51775.83,
 47824.59,
 188846.4]

In [47]:
muestra

      id  salary_in_usd
0      0          70377
1      1          85839
2      2          63613
3      3          88561
4      4          37621
..   ...            ...
102  102          70639
103  103          33678
104  104          19021
105  105          21175
106  106          34801

[107 rows x 2 columns]

### aรฑadir una columna al dataframe con un valor obtenido

In [48]:
muestra['salary_in_usd'] = y_pred_testeo

In [49]:
muestra

      id  salary_in_usd
0      0      172943.50
1      1       87680.00
2      2       84892.22
3      3      144349.28
4      4       28957.12
..   ...            ...
102  102      169980.00
103  103      190726.00
104  104      229503.20
105  105       57216.01
106  106      129391.25

[107 rows x 2 columns]

In [50]:
 muestra.shape

(107, 2)

### MSE & RMSE

In [51]:
from sklearn.metrics import mean_squared_error

In [52]:
import math

In [53]:
MSE = mean_squared_error(y_train, y_pred_train)
MSE

27167600.93939401

In [54]:
RMSE = math.sqrt(MSE)
RMSE

5212.254880509395

### MODELO : GradientBoostingRegressor

In [55]:
from sklearn.datasets import make_regression

In [56]:
from sklearn.ensemble import GradientBoostingRegressor

ENTRENAMOS

In [57]:
boo = GradientBoostingRegressor() # INICIAMOS

In [58]:
boo.fit(X_train, y_train) # ENTRENAMOS el train

GradientBoostingRegressor()

In [59]:
y_pred_train=boo.predict(X_train) # PREDECIMOS el train

In [60]:
y_pred_train[:10]

array([181519.8300701 ,  10997.42672529, 415980.01865258, 131421.99813875,
        13714.24665712, 135554.16119802, 119031.24946791, 153457.03369915,
         7601.61642066, 174595.97917352])

In [61]:
len(y_pred_train)

400

In [62]:
len(X_train)

400

TESTEAMOS

In [63]:
boo.fit(X_train, y_train)

GradientBoostingRegressor()

In [64]:
y_pred_testeo=boo.predict(X_testeo) # PREDECIMOS el TESTEO

In [65]:
y_pred_testeo[:10]

array([227465.99648244,  92321.42454372,  91674.71991892,  99571.03396191,
        44717.59328292,  13711.40674381,  72332.24479953,  51170.40094856,
        40312.75700411, 188545.45030845])

In [66]:
len(y_pred_testeo)

107

### DATAFRAME COMPARACION Y_TRAIN, Y_PRED_TRAIN

In [69]:
MSE = mean_squared_error(y_train, y_pred_train)
MSE

15305650.018972795

In [70]:
RMSE = math.sqrt(MSE)
RMSE

3912.243604247158